Repository: pv-espindola/meu_portifolio
Catalog: lib/config/localization/app_*.arb
Languages: pt

# hello
source: Hello on english
pt: Oi em portugues

# introductionValue
source: I am looking for a position as a Flutter Developer Full-Stack/Front-end, where I can apply my front-end development skills, using Flutter technology to create exceptional user experiences. My goal is to contribute to innovative projects, collaborate with multidisciplinary teams, and apply my knowledge in clean code, MVC/MVVM architecture, and agile methodologies to deliver high-quality solutions. Furthermore, I am seeking opportunities to enhance my knowledge in back-end development, always striving to propose technological advancements in systems. I am enthusiastic about being part of a collaborative environment where I can develop efficient and impactful applications to meet user needs and contribute to the company's growth.
pt: Busco uma posição como Flutter Developer Full-Stack/Front-end, onde eu possa aplicar minhas habilidades em desenvolvimento front-end, utilizando a tecnologia Flutter para criar experiências excepcionais para os usuários. Meu objetivo é contribuir para projetos inovadores, colaborando com equipes multidisciplinares e aplicando meu conhecimento em clean code, arquitetura MVC/MVVM e metodologias ágeis para fornecer soluções de alta qualidade. Além disso, busco oportunidades para aprimorar meu conhecimento em desenvolvimento back-end, buscando sempre propor evoluções tecnológicas nos sistemas. Estou entusiasmado em fazer parte de um ambiente colaborativo, onde possa desenvolver aplicativos eficientes e impactantes para atender às necessidades dos usuários e contribuir para o crescimento da empresa.

# summaryTitle
source: summary
pt: RESUMO

# summaryValue1
source: IT professional with a degree in Information Systems from Cotemig and specialization in Java language from Oracle. Has experience as an IT technician and later ventured into the fitness industry. Returned to development and enhanced skills in Front-end, including HTML, PHP, CSS, JavaScript, UI/UX, and web development.
pt: Profissional de TI com formação em Sistemas da Informação pelo Cotemig e especialização em linguagem Java pela Oracle. Possui experiência como técnico de TI e posteriormente empreendeu na área de academias. Retornou ao desenvolvimento e aprimorou habilidades em Front-end, incluindo HTML, PHP, CSS, JavaScript, UI/UX e desenvolvimento web.

# summaryValue2
source: I discovered the passion for Flutter in 2020, becoming a Full-Stack professional capable of developing mobile applications from scratch to the final product. At Exacology, I worked as an Android developer, taking on great responsibilities after Senior left. I look for new opportunities to apply my skills in challenging projects.
pt: Descobri a paixão por Flutter em 2020, tornando-se um profissional Full-Stack capaz de desenvolver aplicações mobile do zero ao produto final. Na Exacology, atuou como desenvolvedor Android, assumindo responsabilidades de um Senior após sua saída. Procura novas oportunidades para aplicar suas habilidades em projetos desafiadores.

# contactTitle
source: contact
pt: Contato

# projectTitle
source: projects
pt: PROJETOS

# projectValue1
source: In the project, I developed the front-end following the principles of clean code and the MVC/MVVM architecture. My responsibilities included the planning and execution of complex features, as well as the proposition of technological improvements to the system. I worked as development coordinator, working together with the backend team, designer and product manager. We use versioning tools like Git and adopt agile methodologies like Scrum. The application had three main sections: a Chat, psychological testing area and user lists in various categories, providing users with a way to assess their connections beyond the initial appearance. A major challenge in this project was my first contact with websocket, where I implemented from scratch all chat from a WS server integrated with an API written in python where I stored the messages sent in the database.
pt: No projeto, desenvolvi o front-end seguindo os princípios de clean code e a arquitetura MVC/MVVM. Minhas responsabilidades incluíam o planejamento e a execução de funcionalidades complexas, bem como a proposição de melhorias tecnológicas para o sistema. Atuei como coordenador do desenvolvimento, trabalhando em conjunto com a equipe de backend, designer e gerente de produto. Utilizamos ferramentas de versionamento como o Git e adotamos metodologias ágeis, como o Scrum. O aplicativo contava com três seções principais: um Chat, área de testes psicológicos e listas de usuários em categorias diversas, proporcionando aos usuários uma maneira de avaliar suas conexões além da aparência inicial. A funcionalidade de borramento da foto até um número específico de interações foi implementada para incentivar avaliações baseadas em critérios mais profundos.

# projectValue2
source: The project in development uses the Dart language and relies on the collaboration of veterinarians to create an application that stores and organizes information about workplaces and the patients treated in those places. The goal is to facilitate the generation of daily documents, such as shift reports, clinical reports, and prescriptions. The idea is that, in the future, this information can be shared among users of the application's network. Currently, the app is not yet available on the Play Store.
pt: O projeto em desenvolvimento utiliza a linguagem Dart e conta com a colaboração de veterinários para criar um aplicativo que armazena e organiza informações sobre locais de trabalho e os pacientes atendidos nesses locais. O objetivo é facilitar a geração de documentos diários, como laudos de plantão, laudos clínicos e receituários. A ideia é que, no futuro, essas informações possam ser compartilhadas entre os usuários da rede do aplicativo. Atualmente, o app ainda não está disponível na Play Store.

# projectTitle1
source: Exacology — Vera (Social network based on psychological tests.)
pt: Exacology — Vera (Rede social baseada em testes psycologicos)

# projectTitle2
source: Vet_care — Veterinary information management app.
pt: Vet_care — App de gerenciamento de informações veterinárias

# educationTitle
source: Education
pt: Escolaridade

# educationValue1
source: Information system degree - Faculdade Cotemig
pt: Graduação em Sistemas de infornação - Faculdade Cotemig

# educationValue2
source: Android Formation Technician - Alura
pt: Tecnico em Formação Android - Alura

# skillsTitle
source: Skills
pt: Habilidades e Competencias

# skillsTopicValue1
source: Programming languages
pt: Linguagens de Programação

# skillsTopicValue2
source: Technologies and Frameworks
pt: Tecnologias e Frameworks

# skillsTopicValue3
source: Database
pt: Banco de dados

# skillsTopicValue4
source: Media editing
pt: Edição de midias

# skillsTopicValue5
source: Languages
pt: Idiomas

# generalAttributionsTitle
source: general attributions
pt: ATRIBUICÕES GERAIS

# attributionsValue1
source: The entire front-end development based on clean code principles and MVC/MVVM architecture.
pt: Todo o desenvolvimento de front-end baseado em premissas de clean code e arquitetura MVC/MVVM.

# attributionsValue2
source: Executing and planning the development of complex functionalities.
pt: Executar e planejar o desenvolvimento das funcionalidades complexas.

# attributionsValue3
source: Proposing technological advancements in the systems.
pt: Propor evoluções tecnológicas nos sistemas.

# attributionsValue4
source: Coordinating the development with the backend, designer, and product manager.
pt: Coordenar o desenvolvimento junto ao backend, designer e gerente de produto.

# attributionsValue5
source: Using version control tools (GIT) and agile methods (SCRUM).
pt: Utilizar ferramentas de versionamento(GIT) e métodos ágeis(SCRUM).

# openLetterTitle
source: Open letter
pt: Nota do desenvolvedor

# openLetterValue
source: Subject: Request for Consideration to showcasing my Abilities as a Flutter Developer Dear Tech Recruiters, I hope this letter finds you well. My primary intention in building this web application is to capture the attention of recruiters, showcasing my capabilities as a programmer. While I may not excel in the art of social acrobatics, I firmly believe that my straightforward and fearless approach positively extends to my professional environment, allowing me to make meaningful contributions. Recently, I have observed a phenomenon in the recruitment process where HR professionals are inundated with a higher volume of resumes to review, leaving them with increasingly limited time to do so. Consequently, many have turned to automated tools to aid them in their tasks. I am confident in my technical abilities, including designing layouts, integrating APIs, and planning and executing the development of complex functionalities. Moreover, I strive to absorb best development practices, ensuring that my code is not only functional but also valuable to my colleagues who interact with it. However, I find myself uncertain about how to effectively demonstrate my skills to the right recruiter at the right time. Admittedly, this web application, in its current state, may appear simple and may not fully meet the expectations you seek. I am not inclined to unnecessarily complicate this project; instead, I aim to make it smart and impactful. If you are a recruiter seeking a Flutter developer, I would like to make a humble request. Could you propose a 'challenge' or task that involves developing a feature or functionality within this project, or any other project of your choosing? In return, I promise to seize this opportunity and demonstrate my abilities to succeed professionally. I genuinely appreciate your time and consideration, and I eagerly await the possibility of working together to further discuss how I can contribute my skills to your esteemed organization. Thank you for your attention. Sincerely, Paulo Victor.
pt: Assunto: Pedido de Consideração demonstrando minhas habilidades como Desenvolvedor Flutter Prezados Recrutadores de Tecnologia, Espero que esta carta os encontre bem. Minha intenção principal ao criar esta aplicação web é chamar a atenção dos recrutadores, demonstrando minhas capacidades como programador. Embora eu possa não ser muito habilidoso no que diz respeito ao "malabarismo social", acredito firmemente que minha abordagem direta e destemida se estende positivamente ao meu ambiente profissional, permitindo-me fazer contribuições significativas. Recentemente, tenho observado um fenômeno no processo de recrutamento, no qual os profissionais de RH são inundados com um maior número de currículos para analisar, deixando-lhes cada vez menos tempo para fazê-lo. Como consequência, muitas vezes recorrem a ferramentas automatizadas para ajudá-los em suas tarefas. Estou confiante em minhas habilidades técnicas, incluindo o design de layouts, a integração de APIs e o planejamento e execução do desenvolvimento de funcionalidades complexas. Além disso, busco absorver as melhores práticas de desenvolvimento, garantindo que meu código seja não apenas funcional, mas também valioso para meus colegas que interagem com ele. No entanto, encontro-me incerto sobre como demonstrar de forma eficaz minhas habilidades ao recrutador certo, no momento adequado. Admito que esta aplicação web, em seu estado atual, pode parecer simples e talvez não atenda plenamente às expectativas que vocês buscam. Não tenho interesse em complicar desnecessariamente este projeto; meu objetivo é torná-lo inteligente e impactante. Se você é um recrutador em busca de um desenvolvedor Flutter, gostaria de fazer um humilde pedido. Seria possível propor um "desafio" ou tarefa que envolva o desenvolvimento de uma funcionalidade dentro deste projeto, ou qualquer outro projeto de sua escolha? Em troca, prometo aproveitar esta oportunidade e demonstrar minhas habilidades para obter sucesso profissional. Agradeço sinceramente sua atenção e consideração, e aguardo ansiosamente a possibilidade de trabalharmos juntos para discutir como posso contribuir com minhas habilidades para a sua respeitada organização. Obrigado pelo seu tempo. Atenciosamente, Paulo Victor.
